# Prepare a dataset for students with 10 rows having columns student ID, Name, Gender, Marks, Address, pass/fail,DOB column etc.

In [1]:
#Importing required libraries
import pandas as pd

In [2]:
Students=["Patwari Raghu","Polisetty Siri","Thammisetti Charan","Ravulapalli Kushal","Sreeramdas Tejesvi","Rasamalla Tharun","Panyala Navy","P Ram","T Veen","Pogu Umesh"]
Student_id=[100,101,102,103,104,105,106,107,108,109]
Gender=["M","F","M","M","F","M","F","M","F","M"]
Marks=[34,85,78,99,76,21,89,66,31,81]
Address=["Hyderabad","Cinncinati","Karimnagar","Dharmapuri","Dallas","Florida","Albany","Hyderabad","Hyderabad","Warangal"]
grades=["Fail","Pass","Pass","Pass","Pass","Fail","Pass","Pass","Fail","Pass"]
DOB=["2000-08-16","1999-11-11","1999-11-10","1999-09-05","1999-08-18","1999-09-01","1999-06-20","1998-04-12","1999-06-24","1999-02-01"]

In [3]:
df=pd.DataFrame({"Sid":Student_id,"Name":Students,"Gender":Gender,"Marks":Marks,"Address":Address,"pass/fail":grades,"DOB":DOB})

In [4]:
df1=df.copy()
df1

   Sid                Name Gender  Marks     Address pass/fail         DOB
0  100       Patwari Raghu      M     34   Hyderabad      Fail  2000-08-16
1  101      Polisetty Siri      F     85  Cinncinati      Pass  1999-11-11
2  102  Thammisetti Charan      M     78  Karimnagar      Pass  1999-11-10
3  103  Ravulapalli Kushal      M     99  Dharmapuri      Pass  1999-09-05
4  104  Sreeramdas Tejesvi      F     76      Dallas      Pass  1999-08-18
5  105    Rasamalla Tharun      M     21     Florida      Fail  1999-09-01
6  106        Panyala Navy      F     89      Albany      Pass  1999-06-20
7  107               P Ram      M     66   Hyderabad      Pass  1998-04-12
8  108              T Veen      F     31   Hyderabad      Fail  1999-06-24
9  109          Pogu Umesh      M     81    Warangal      Pass  1999-02-01

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Sid        10 non-null     int64
 1   Name       10 non-null     object
 2   Gender     10 non-null     object
 3   Marks      10 non-null     int64
 4   Address    10 non-null     object
 5   pass/fail  10 non-null     object
 6   DOB        10 non-null     object
dtypes: int64(2), object(5)
memory usage: 688.0+ bytes

In [6]:
df1["DOB"]=pd.to_datetime(df1["DOB"])
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Sid        10 non-null     int64
 1   Name       10 non-null     object
 2   Gender     10 non-null     object
 3   Marks      10 non-null     int64
 4   Address    10 non-null     object
 5   pass/fail  10 non-null     object
 6   DOB        10 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(4)
memory usage: 688.0+ bytes

## 1. Get the names of students with lowest marks.

In [7]:
df1.loc[df1["Marks"]==df1["Marks"].min(),["Name","Marks"]]

               Name  Marks
5  Rasamalla Tharun     21

## 2. Get the name and marks of those students whose scored marks are less than average marks for the entire class.

In [7]:
df1.loc[df1["Marks"]<df1["Marks"].mean(),["Name","Marks"]]

               Name  Marks
0     Patwari Raghu     34
5  Rasamalla Tharun     21
8            T Veen     31

## 3. Add a column to extract first name and last name from Name column.

In [9]:
last=[]
for i in range(len(g)):
    for j in range(1,2):
        last.append(g[i][j])
first=[]
for i in range(len(g)):
    for j in range(1):
        first.append(g[i][j])

In [10]:
df1["FirstName"]=first
df1["LastName"]=last
df1

,Sid,Name,Gender,Marks,Address,pass/fail,DOB,FirstName,LastName
0,100,Patwari Raghu,M,34,Hyderabad,Fail,2000-08-16,Patwari,Raghu
1,101,Polisetty Siri,F,85,Cinncinati,Pass,1999-11-11,Polisetty,Siri
2,102,Thammisetti Charan,M,78,Karimnagar,Pass,1999-11-10,Thammisetti,Charan
3,103,Ravulapalli Kushal,M,99,Dharmapuri,Pass,1999-09-05,Ravulapalli,Kushal
4,104,Sreeramdas Tejesvi,F,76,Dallas,Pass,1999-08-18,Sreeramdas,Tejesvi
5,105,Rasamalla Tharun,M,21,Florida,Fail,1999-09-01,Rasamalla,Tharun
6,106,Panyala Navy,F,89,Albany,Pass,1999-06-20,Panyala,Navy
7,107,P Ram,M,66,Hyderabad,Pass,1998-04-12,P,Ram
8,108,T Veen,F,31,Hyderabad,Fail,1999-06-24,T,Veen
9,109,Pogu Umesh,M,81,Warangal,Pass,1999-02-01,Pogu,Umesh

## 4. Get those student names whose names start with the letter 'a'.

In [11]:
df1.loc[df1["Name"].str.startswith("a")]

Empty DataFrame
Columns: [Sid, Name, Gender, Marks, Address, pass/fail, DOB, FirstName, LastName]
Index: []

In [12]:
df1.loc[df1["Name"].str.startswith("P")]

,Sid,Name,Gender,Marks,Address,pass/fail,DOB,FirstName,LastName
0,100,Patwari Raghu,M,34,Hyderabad,Fail,2000-08-16,Patwari,Raghu
1,101,Polisetty Siri,F,85,Cinncinati,Pass,1999-11-11,Polisetty,Siri
6,106,Panyala Navy,F,89,Albany,Pass,1999-06-20,Panyala,Navy
7,107,P Ram,M,66,Hyderabad,Pass,1998-04-12,P,Ram
9,109,Pogu Umesh,M,81,Warangal,Pass,1999-02-01,Pogu,Umesh

## 5. Get highest marks separately for male and female group.

In [13]:
df1.groupby("Gender")[["Marks"]].max()

        Marks
Gender
F          89
M          99

## 6.The people who have passed are more in male or female group.

In [14]:
g=df1.groupby("Gender")

In [15]:
g.get_group("M").loc[g.get_group("M")["pass/fail"]=="Pass"]

,Sid,Name,Gender,Marks,Address,pass/fail,DOB,FirstName,LastName
2,102,Thammisetti Charan,M,78,Karimnagar,Pass,1999-11-10,Thammisetti,Charan
3,103,Ravulapalli Kushal,M,99,Dharmapuri,Pass,1999-09-05,Ravulapalli,Kushal
7,107,P Ram,M,66,Hyderabad,Pass,1998-04-12,P,Ram
9,109,Pogu Umesh,M,81,Warangal,Pass,1999-02-01,Pogu,Umesh

In [16]:
g.get_group("M").loc[g.get_group("M")["pass/fail"]=="Pass",["Name","pass/fail"]]

                 Name pass/fail
2  Thammisetti Charan      Pass
3  Ravulapalli Kushal      Pass
7               P Ram      Pass
9          Pogu Umesh      Pass

In [17]:
g.get_group("M").loc[g.get_group("M")["pass/fail"]=="Pass",["Name","pass/fail"]].count()

Name         4
pass/fail    4
dtype: int64

In [18]:
g.get_group("F").loc[g.get_group("F")["pass/fail"]=="Pass",["Name","pass/fail"]]

                 Name pass/fail
1      Polisetty Siri      Pass
4  Sreeramdas Tejesvi      Pass
6        Panyala Navy      Pass

In [19]:
g.get_group("F").loc[g.get_group("F")["pass/fail"]=="Pass",["Name","pass/fail"]].count()

Name         3
pass/fail    3
dtype: int64

## Insights:
- There are more Male students who has passed compared to female

## 7. Get highest marks separately for male and female group and the names of people who have scored those high marks in the respective groups.

In [43]:
g=df1.groupby("Gender")["Marks"].idxmax()
df1.loc[g,["Name","Gender","Marks"]]

                 Name Gender  Marks
6        Panyala Navy      F     89
3  Ravulapalli Kushal      M     99

## 8. For the different genders only filter those records whore passing is more.

In [21]:
g1=df1.groupby("Gender")
g1.get_group("M").loc[g1.get_group("M")["Marks"]>35,["Name","pass/fail"]]

                 Name pass/fail
2  Thammisetti Charan      Pass
3  Ravulapalli Kushal      Pass
7               P Ram      Pass
9          Pogu Umesh      Pass

In [22]:
g1.get_group("F").loc[g1.get_group("F")["Marks"]>35,["Name","pass/fail"]]

                 Name pass/fail
1      Polisetty Siri      Pass
4  Sreeramdas Tejesvi      Pass
6        Panyala Navy      Pass

## 9. Calculate the ages using the DOB column.

In [23]:
df1["Age"]=pd.to_datetime("today").year-df1["DOB"].dt.year
df1

,Sid,Name,Gender,Marks,Address,pass/fail,DOB,FirstName,LastName,Age
0,100,Patwari Raghu,M,34,Hyderabad,Fail,2000-08-16,Patwari,Raghu,24
1,101,Polisetty Siri,F,85,Cinncinati,Pass,1999-11-11,Polisetty,Siri,25
2,102,Thammisetti Charan,M,78,Karimnagar,Pass,1999-11-10,Thammisetti,Charan,25
3,103,Ravulapalli Kushal,M,99,Dharmapuri,Pass,1999-09-05,Ravulapalli,Kushal,25
4,104,Sreeramdas Tejesvi,F,76,Dallas,Pass,1999-08-18,Sreeramdas,Tejesvi,25
5,105,Rasamalla Tharun,M,21,Florida,Fail,1999-09-01,Rasamalla,Tharun,25
6,106,Panyala Navy,F,89,Albany,Pass,1999-06-20,Panyala,Navy,25
7,107,P Ram,M,66,Hyderabad,Pass,1998-04-12,P,Ram,26
8,108,T Veen,F,31,Hyderabad,Fail,1999-06-24,T,Veen,25
9,109,Pogu Umesh,M,81,Warangal,Pass,1999-02-01,Pogu,Umesh,25

## 10. Get the students age.  mean, median, standard deviation, variance.

In [24]:
df1["Age"].describe()

count    10.000000
mean     25.000000
std       0.471405
min      24.000000
25%      25.000000
50%      25.000000
75%      25.000000
max      26.000000
Name: Age, dtype: float64

In [25]:
df1["Age"].mean()

25.0

In [26]:
df1["Age"].median()

25.0

In [27]:
df1["Age"].var()

0.2222222222222222

In [46]:
df1["Age"].std()

0.4714045207910317